<template>
    <div class="about">
      <h1>О проекте</h1>
      <p>
        Добро пожаловать! Данный сервис разработан для удобного отслеживания рейтингов игроков в бадминтон. На данный момент реализован поиск по рейтингу игроков НФБР.
        Здесь вы можете найти игроков по имени, посмотреть их текущий рейтинг и историю изменений в разных категориях игры.  
      </p>
      <p>
        Проект создан для любителей бадминтона и тех, кто хочет следить за своими достижениями или анализировать игру других.
      </p>
      <h1>Нашли ошибку?</h1>
      <p>
        Данные о рейтингах игроков берутся с официального сайта НФБР. К сожалению, там эти данные плохо структурированы и не целостные (это собственно одна из причин по которой я начал работу над сервисом). 
        Большую часть проблем целостности (опечатки в именах, ошибки в годах и пр.) мне удалось решить автоматически, но не все. Поэтому, сейчас вы можете найти игрока (или себя) с разными годами рождения или регионом.
        Постепенно я буду улучшать целостность данных, возможно сделаю функцию слияния игроков в ручном режиме и много еще чего.
      </p>
      <p>
        Буду благодарен, если вы сообщите об ошибке в данных или другой проблеме на этом сайте. Со мной можно свзяаться в Telegram <b>@bogdanovmn</b> или по почте <b>bogdanovmn@gmail.com</b>
      </p>
    
    </div>
  </template>
  
  <style scoped>

  .about {
    min-height: 600px;
    max-width: 800px;
    margin: 0 auto;
    padding: 20px;
  }
  
  h1 {
    font-size: 2rem;
    margin-bottom: 20px;
    text-align: center;
  }
  
  h2 {
    font-size: 1.5rem;
    margin-top: 20px;
    margin-bottom: 10px;
  }
  
  p {
    font-size: 1.1rem;
    line-height: 1.6;
    margin-bottom: 15px;
  }
  
  ul {
    list-style-type: disc;
    padding-left: 20px;
  }
  
  li {
    font-size: 1.1rem;
    margin-bottom: 10px;
  }
  </style>